app/controllers/players_controller.rb

INSERT INTO "players" ("avatar", "created_at", "cumulative_wins", "current_score", "email", "name", "pin", "skill", "total_games", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "players" SET "avatar" = 'http://bbsimg.ngfiles.com/1/21544000/ngbbs4c52149d38558.gif', "updated_at" = '2013-07-19 03:25:39.394489' WHERE "players"."id" = 1
---
  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy